In [1]:
# Import Pandas and NumPy

import numpy as np
import pandas as pd

#pip install db-sqlite3
#SQLite in general is a server-less database that you can use within almost all programming languages including Python.
import sqlite3

In [2]:
db = 'movies.sqlite'


conn = sqlite3.connect(db)
cur = conn.cursor()

# # Question 3: Check how many movies are present in IMDB.

In [3]:
cur.execute('SELECT * FROM movies')
#use the cursor object to call the execute() method to execute any SQL queries.
movies = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

movies = pd.DataFrame(movies, columns = ['id', 'original_title', 'budget', 'popularity', 'release_date', 'revenue', 'title', 'vote_average', 'vote_count', 'overview', 'tagline', 'uid', 'director_id'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.



print('Total number of movies present in IMDB :',movies.shape)
movies.head()
#movies.count()
#movies.info()
#Displays first 3 rows in the table

Total number of movies present in IMDB : (4773, 13)

,id,original_title,budget,popularity,release_date,revenue,title,vote_average,vote_count,overview,tagline,uid,director_id
0,43597,Avatar,237000000,150,2009-12-10,2787965087,Avatar,7.2,11800,"In the 22nd century, a paraplegic Marine is di...",Enter the World of Pandora.,19995,4762
1,43598,Pirates of the Caribbean: At World's End,300000000,139,2007-05-19,961000000,Pirates of the Caribbean: At World's End,6.9,4500,"Captain Barbossa, long believed to be dead, ha...","At the end of the world, the adventure begins.",285,4763
2,43599,Spectre,245000000,107,2015-10-26,880674609,Spectre,6.3,4466,A cryptic message from Bond’s past sends him o...,A Plan No One Escapes,206647,4764
3,43600,The Dark Knight Rises,250000000,112,2012-07-16,1084939099,The Dark Knight Rises,7.6,9106,Following the death of District Attorney Harve...,The Legend Ends,49026,4765
4,43601,John Carter,260000000,43,2012-03-07,284139100,John Carter,6.1,2124,"John Carter is a war-weary, former military ca...","Lost in our world, found in another.",49529,4766

ANALYSIS :-I selected the table movies  with columns contains id, original_title, budget, popularity,release_date, revenue, title, vote_average,	vote_count,	overview, tagline, uid, director_id,   

After analyzing the data I fount that,

Total number of movies present in IMDB : 4773 13

# Question 4: Find these 3 directors: James Cameron ; Luc Besson ; John Woo

In [4]:
cur.execute("SELECT * FROM directors  WHERE name IN ('James Cameron', 'Luc Besson', 'John Woo')")
#use the cursor object to call the execute() method to execute any SQL queries.
directors = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

directors = pd.DataFrame(directors, columns = ['name', 'id', 'gender', 'uid', 'department'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.

print('Find these 3 directors: James Cameron ; Luc Besson ; John Woo :',directors.shape)
directors.head()

Find these 3 directors: James Cameron ; Luc Besson ; John Woo : (3, 5)

            name    id  gender    uid department
0  James Cameron  4762       2   2710  Directing
1       John Woo  4893       2  11401  Directing
2     Luc Besson  4949       2     59  Directing

ANALYSIS :-I selected the table directors with columns contains name, id, gender, uid and department. After analyzing the data I fount that,

I find these 3 directors: James Cameron ; Luc Besson ; John Woo from the table directors

# Question 5: Find all directors with name starting with Steven.

In [69]:
cur.execute("SELECT * FROM directors  WHERE name LIKE ('Steven')")
#use the cursor object to call the execute() method to execute any SQL queries.
directors = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

directors = pd.DataFrame(directors, columns = ['name', 'id', 'gender', 'uid', 'department'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.

print('Name all directors with name starting with Steven :',directors.shape)
directors.head()

Name all directors with name starting with Steven : (0, 5)

Empty DataFrame
Columns: [name, id, gender, uid, department]
Index: []

ANALYSIS :- I counted number of femal directors where gender = '1' .   
After analyzing the data I fount that,

Name all directors with name starting with Steven"150"

# Question 6: Count female directors.

In [37]:
cur.execute("SELECT COUNT (*) FROM directors  WHERE gender = '1'")
#use the cursor object to call the execute() method to execute any SQL queries.
directors = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

#directors = pd.DataFrame(directors, columns = ['name', 'id', 'gender', 'uid', 'department'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.

print(f"Total number of Female Directors is :{directors}")

Total number of Female Directors is :[(150,)]

ANALYSIS :- I counted number of femal directors where gender = '1' .   
After analyzing the data I fount that,

Total number of Female Directors is "150"

# Question 7: Find the name of the 10th first women directors?

In [68]:
cur.execute("SELECT * FROM directors  WHERE gender = '1' ORDER BY id ASC")
#use the cursor object to call the execute() method to execute any SQL queries.
directors = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

directors = pd.DataFrame(directors, columns = ['name', 'id', 'gender', 'uid', 'department'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.

print('Name of the first 10th women directors are  :',directors.shape)
directors.head(10)

Name of the first 10th women directors are  : (150, 5)

                  name    id  gender     uid department
0       Brenda Chapman  4801       1   59803  Directing
1      Lilly Wachowski  4805       1    9339  Directing
2  Jennifer Yuh Nelson  4853       1  142312  Directing
3      Kathryn Bigelow  4970       1   14392  Directing
4         Nancy Meyers  4978       1   17698  Directing
5          Jill Culton  4979       1    7881  Directing
6           Mimi Leder  4996       1   51984  Directing
7         Vicky Jenson  5032       1   12058  Directing
8         Betty Thomas  5052       1   31024  Directing
9       Angelina Jolie  5086       1   11701  Directing

ANALYSIS :- I generated a table with 5 columns of name, id, gender, uid and department .   
After analyzing the data I fount that,

Name of the first 10th women directors are:-
	Brenda Chapman	
 	Lilly Wachowski	
	Jennifer Yuh Nelson	
	Kathryn Bigelow	
	Nancy Meyers	
	Jill Culton	
	Mimi Leder	
	Vicky Jenson	
	Betty Thomas	
	Angelina Jolie

# Question 8: What are the 3 most popular movies?

In [74]:
cur.execute('SELECT movies.id ,movies.original_title, movies.popularity, movies.title, movies.director_id FROM movies ORDER BY popularity DESC LIMIT 3')
#use the cursor object to call the execute() method to execute any SQL queries.
movies = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

movies = pd.DataFrame(movies, columns = ['id', 'original_title',  'popularity', 'title', 'director_id'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.



print(' Three most popular Movies data :',movies.shape)
movies.head()
##Displays most popular 3 movies in the table

 Three most popular Movies data : (3, 5)

      id original_title  popularity         title  director_id
0  44143        Minions         875       Minions         5045
1  43692   Interstellar         724  Interstellar         4765
2  44385       Deadpool         514      Deadpool         5151

ANALYSIS :- I generated a table with 5 columns of id, original_title, popularity, title and director_id .   
After analyzing the data I fount that,

Three most popular Movies data are:
Minions	
Interstellar	
Deadpool

# Question 9: What are the 3 most bankable movies?

In [67]:
cur.execute('SELECT * FROM movies ORDER BY budget DESC LIMIT 3')
#use the cursor object to call the execute() method to execute any SQL queries.
movies = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

movies = pd.DataFrame(movies, columns = ['id', 'original_title', 'budget', 'popularity', 'release_date', 'revenue', 'title', 'vote_average', 'vote_count','overview','tagline', 'uid', 'director_id'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.

movies = movies.drop(['popularity', 'release_date', 'revenue', 'vote_average', 'vote_count','overview','tagline', 'uid'], axis = 1)

print('Three Most bankable movies are :',movies.shape)
movies.head(3)
##Displays 3 most bankable movies in the table

Three Most bankable movies are : (3, 5)

,id,original_title,budget,title,director_id
0,43614,Pirates of the Caribbean: On Stranger Tides,380000000,Pirates of the Caribbean: On Stranger Tides,4775
1,43598,Pirates of the Caribbean: At World's End,300000000,Pirates of the Caribbean: At World's End,4763
2,43604,Avengers: Age of Ultron,280000000,Avengers: Age of Ultron,4769

ANALYSIS :- I generated a table with 5 columns of id, original_title,budget,title and director_id .   
After analyzing the data I fount that,

Three Most bankable movies are:-
Pirates of the Caribbean: On Stranger Tides
Pirates of the Caribbean: At World's End
Avengers: Age of Ultron

# Question 10: What is the most awarded average vote since the January 1st, 2000?

In [66]:
cur.execute("SELECT  movies.id , movies.original_title, movies.release_date ,movies.vote_average ,movies.director_id FROM movies WHERE release_date >'2000' ORDER BY vote_average DESC LIMIT 1")
#use the cursor object to call the execute() method to execute any SQL queries.
movies = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

movies = pd.DataFrame(movies, columns = ['id', 'original_title', 'release_date', 'vote_average', 'director_id'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.


print('Most awarded average vote since the January 1st,2000 :',movies.shape)
movies.head(1)
##Displays 1 most awarded average vote since the January 1st,2000 movies in the table

Most awarded average vote since the January 1st,2000 : (1, 5)

      id original_title release_date  vote_average  director_id
0  47589      Sardaarji   2015-06-26           9.5         6588

ANALYSIS :- I generated a table with 5 columns of id, original_title, release_date, vote_average, director_id .        
After analyzing the data I fount that,

Most awarded average vote since the January 1st,2000  is "Sardaarji" .

# Question 11: Which movie(s) were directed by Brenda Chapman?

In [137]:
#cur.execute("SELECT title  FROM  movies JOIN directors  ON directors.id = movies.director_id WHERE directors.name = ('Brenda Chanpaman') ")
cur.execute("SELECT * FROM directors WHERE name = ('Brenda Chapman')")
#use the cursor object to call the execute() method to execute any SQL queries.
directors = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

directors = pd.DataFrame(directors, columns = ['name', 'id', 'gender', 'uid', 'department'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.


print('Most popular Movies data :',directors.shape)

directors.head(10)
##Displays 1 most awarded average vote since the January 1st,2000 movies in the table

Most popular Movies data : (1, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        1 non-null      object
 1   id          1 non-null      int64
 2   gender      1 non-null      int64
 3   uid         1 non-null      int64
 4   department  1 non-null      object
dtypes: int64(3), object(2)
memory usage: 172.0+ bytes

             name    id  gender    uid department
0  Brenda Chapman  4801       1  59803  Directing

In [ ]:
uid =59803, id =4801

# Question 12: Whose director made the most movies?

In [62]:
cur.execute(" SELECT name, COUNT(movies.id) AS movies_count FROM directors JOIN movies ON directors.id = movies.director_id GROUP BY director_id ORDER BY movies_count DESC ;")
#cur.execute("SELECT directors, COUNT(*) as movie_count FROM movies GROUP BY directors_id ORDER BY movie_count DESC LIMIT 1;")
#use the cursor object to call the execute() method to execute any SQL queries.
directors = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

directors = pd.DataFrame(directors, columns = ['name','movies_count'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.

print('Dirctor who made the most movies is :',directors.shape)
directors.head(1)

Dirctor who made the most movies is : (2349, 2)

               name  movies_count
0  Steven Spielberg            27

ANALYSIS :- I generated a table with 2 columns of name and movie_count .        
After analyzing the data I fount that,

Director Steven Spielberg  has made the heighest number of movies, totaling 27

# Question 13: Whose director is the most bankable?

In [106]:
cur.execute("SELECT name FROM directors  JOIN movies ON directors.id = movies.director_id GROUP BY directors.id ORDER BY budget desc limit 1;")
#use the cursor object to call the execute() method to execute any SQL queries.
directors = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

directors = pd.DataFrame(directors, columns = ['name'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.

#movies = movies.drop(['popularity', 'release_date', 'revenue', 'vote_average', 'vote_count','overview','tagline', 'uid'], axis = 1)

print(' Director  with most bankable movie :',directors.shape)
directors.head(10)
##Displays Director name with most bankable movies in the table

 Director  with most bankable movie : (1, 1)

           name
0  Rob Marshall

ANALYSIS :- I generated a table with 1 columns of name .        
After analyzing the data I fount that,

Director Rob Marshall  directed the most bankable movie.

# Budget Analysis , Question - List out Top 10 highest budget made movies

In [60]:
cur.execute('SELECT movies.id, movies.original_title, movies.budget, movies.title, movies.director_id FROM movies ORDER BY budget  DESC LIMIT 10')
#use the cursor object to call the execute() method to execute any SQL queries.
movies = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

movies = pd.DataFrame(movies, columns = ['id', 'original_title', 'budget', 'title',  'director_id'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.



print('List top 10 higest budget made movies :',movies.shape)
movies.head(10)

#Displays top 10 higest budget made movies

Shape of Movies data : (10, 5)

,id,original_title,budget,title,director_id
0,43614,Pirates of the Caribbean: On Stranger Tides,380000000,Pirates of the Caribbean: On Stranger Tides,4775
1,43598,Pirates of the Caribbean: At World's End,300000000,Pirates of the Caribbean: At World's End,4763
2,43604,Avengers: Age of Ultron,280000000,Avengers: Age of Ultron,4769
3,43607,Superman Returns,270000000,Superman Returns,4772
4,43601,John Carter,260000000,John Carter,4766
5,43603,Tangled,260000000,Tangled,4768
6,43602,Spider-Man 3,258000000,Spider-Man 3,4767
7,43610,The Lone Ranger,255000000,The Lone Ranger,4763
8,43600,The Dark Knight Rises,250000000,The Dark Knight Rises,4765
9,43605,Harry Potter and the Half-Blood Prince,250000000,Harry Potter and the Half-Blood Prince,4770

ANALYSIS :- I generated a table with 5 columns of id, original_title, budget, title, director_id .
After analyzing the data I fount that, 

LIST of tOP 10 movies with highest budgets  are :-

           Movies                             Budget
Pirates of the Caribbean: On Stranger Tides	3,80000000	
Pirates of the Caribbean: At World's End	3,00000000	
Avengers: Age of Ultron	                    2,80000000	
Superman Returns	                        2,70000000	
John Carter                             	2,60000000	
Tangled	                                    2,60000000	
Spider-Man 3	                            2,58000000	
The Lone Ranger	                            2,55000000	
The Dark Knight Rises	                    2,50000000	T
Harry Potter and the Half-Blood Prince	    2,50000000

# Popularity Analysis ,Question- List out Top 10 popularity on movies

In [59]:
cur.execute('SELECT  movies.id, movies.original_title, movies.popularity, movies.title , movies.director_id FROM movies ORDER BY popularity DESC LIMIT 10')
#use the cursor object to call the execute() method to execute any SQL queries.
movies = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

movies = pd.DataFrame(movies, columns = ['id', 'original_title', 'popularity','title','director_id'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.



print('Shape of Movies data :',movies.shape)
movies.head(10)

#LIst of top 10 popular movies

Shape of Movies data : (10, 5)

,id,original_title,popularity,title,director_id
0,44143,Minions,875,Minions,5045
1,43692,Interstellar,724,Interstellar,4765
2,44385,Deadpool,514,Deadpool,5151
3,43691,Guardians of the Galaxy,481,Guardians of the Galaxy,4827
4,43724,Mad Max: Fury Road,434,Mad Max: Fury Road,4845
5,43625,Jurassic World,418,Jurassic World,4783
6,43796,Pirates of the Caribbean: The Curse of the Bla...,271,Pirates of the Caribbean: The Curse of the Bla...,4763
7,43679,Dawn of the Planet of the Apes,243,Dawn of the Planet of the Apes,4818
8,43797,The Hunger Games: Mockingjay - Part 1,206,The Hunger Games: Mockingjay - Part 1,4831
9,43685,Big Hero 6,203,Big Hero 6,4823

ANALYSIS :- I generated a table with 5 columns of id, original_title, popularity, title, director_id .
After analyzing the data I fount that, 

LIST of tOP 10 Popularity  movies are :-
Minions
Interstellar
Deadpool	
Guardians of the Galaxy
Mad Max: Fury Road
Jurassic World
Pirates of the Caribbean: The Curse of the Bla..
Dawn of the Planet of the Apes
The Hunger Games: Mockingjay - Part 1	
Big Hero 6

# Revenue Analysis ,Question - What are the top 10 Revenue movies

In [55]:
cur.execute('SELECT movies.id, movies.original_title, movies.revenue, movies.title , movies.director_id FROM movies ORDER BY Revenue DESC LIMIT 10')
#use the cursor object to call the execute() method to execute any SQL queries.
movies = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

movies = pd.DataFrame(movies, columns = [ 'id','original_title','revenue', 'title', 'director_id'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.



print('TOP 10 Revenue generated movies  :',movies.shape)
movies.head(10)

#LIst of Top 10 popular movies

TOP 10 Revenue generated movies  : (10, 5)

,id,original_title,revenue,title,director_id
0,43597,Avatar,2787965087,Avatar,4762
1,43622,Titanic,1845034188,Titanic,4762
2,43613,The Avengers,1519557910,The Avengers,4769
3,43625,Jurassic World,1513528810,Jurassic World,4783
4,43641,Furious 7,1506249360,Furious 7,4794
5,43604,Avengers: Age of Ultron,1405403694,Avengers: Age of Ultron,4769
6,43721,Frozen,1274219009,Frozen,4844
7,43628,Iron Man 3,1215439994,Iron Man 3,4784
8,44143,Minions,1156730962,Minions,5045
9,43623,Captain America: Civil War,1153304495,Captain America: Civil War,4781

ANALYSIS :- I generated a table with 5 columns of id, original_title, revenue, title, director_id .
After analyzing the data I fount that, 

TOP 10 Revenue generated movies are :-
Avatar 
Titanic
The Avengers
Jurassic World	
Furious 7
Avengers: Age of Ultron
Frozen
Iron Man 3
Minions
Captain America: Civil War

# Voting Analysis,Question - Display most popular movies with vote_average

In [16]:
cur.execute('SELECT id,original_title ,title, vote_average FROM movies ORDER BY vote_average DESC LIMIT 5')
#use the cursor object to call the execute() method to execute any SQL queries.
movies = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

movies = pd.DataFrame(movies, columns = [ 'id','title','original_title','vote_average'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.



print('Most popular Movies with average voting :',movies.shape)
movies.head(5)

#Displays  popular movies with average voting

Most popular Movies with average voting : (5, 4)

      id                     title            original_title  vote_average
0  47116          Stiff Upper Lips          Stiff Upper Lips          10.0
1  47642     Dancer, Texas Pop. 81     Dancer, Texas Pop. 81          10.0
2  47589                 Sardaarji                 Sardaarji           9.5
3  45983            One Man's Hero            One Man's Hero           9.3
4  45478  The Shawshank Redemption  The Shawshank Redemption           8.5

ANALYSIS :- I generated a table with 4 columns of id, title, original_title and vote_average .      
After analyzing the data I fount that, 

This are the most " 5 " popular movies with average voting is as follows:-
movie :-Stiff Upper Lips	                vote_average:- 10.0
movie :-Dancer, Texas Pop. 81		        vote_average:- 10.0
movie :-Sardaarji		                    vote_average:- 9.5
movie :-One Man's Hero   	                vote_average:- 9.3
movie :-The Shawshank Redemption		    vote_average:- 8.5

# Voting Analysis, Question - List out Particular movie for Voting average and votecount

In [19]:
cur.execute('SELECT id,original_title ,title, vote_average, vote_count FROM movies ORDER BY vote_average AND vote_count DESC LIMIT 1')
#use the cursor object to call the execute() method to execute any SQL queries.
movies = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

movies = pd.DataFrame(movies, columns = [ 'id','title','original_title','vote_average','vote_count'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.



print('Most popular Movie with average voting and have heights vote count :',movies.shape)
movies.head(1)

#Displays  popular movies with average voting and have heights vote count

Most popular Movie with average voting and have heights vote count : (1, 5)

      id   title original_title  vote_average  vote_count
0  43597  Avatar         Avatar           7.2       11800

ANALYSIS :- I generated a table with 5 columns of id, title, original_title, vote_average and vote_count .        

After analyzing the data I fount that, 
Most popular Movie with average voting and have heights vote count is "Avatar"	.

# Directors Analysis, Question- List out the director names with number of movies and revenue

In [54]:
cur.execute(" SELECT directors.name ,COUNT(movies.id) AS movies_count, SUM(movies.revenue) AS Total_revenue FROM directors JOIN movies ON directors.id = movies.director_id GROUP BY directors.id ORDER BY movies_count DESC , Total_revenue DESC LIMIT  1; ")

directors = cur.fetchall()

#movies -> if u print movies , all the data shown in list manner, can't understanadble

#Note - fetchall() --> fetch all rows for the current query, if no rows avaliable then,it returns an empty list.

directors = pd.DataFrame(directors, columns = ['name','movies_count','Total_revenue'])
#Creating a dataframe, A dataframe contains rows and columns , It is a Two-dimensional, size-mutable, potentially heterogeneous tabular data.

print('Dirctor who made the most movies is :',directors.shape)
directors.head(1)

Dirctor who made the most movies is : (1, 3)

               name  movies_count  Total_revenue
0  Steven Spielberg            27     9147393164

ANALYSIS :- I generated a table with 3 columns of name, movies_count and Total_revenue .          After analyzing the data I fount that, 
Director Steven Spielberg has the most number of movies with a total of 27 and he has also generated a total revenue of 9,147,393,164.